# 1. Identifier les types de crimes les plus fréquents par département

En SQL, cette requête aurait demandé 3 jointures, un GROUP BY complexe et des sous-requêtes. En Cypher (Graphe), on suit simplement les flèches visuellement : Département <- Service -> Infraction.

Copiez-collez ceci dans Neo4j :
```
MATCH (d:Departement)<-[:SITUE_DANS]-(s:Service)-[e:A_ENREGISTRE]->(i:Infraction)
// On regroupe et on additionne tous les faits par département et par infraction
WITH d.code AS Departement, i.libelle AS Crime, SUM(e.nombre_faits) AS TotalFaits
ORDER BY TotalFaits DESC
// Pour chaque département, on ne garde que la ligne avec le plus grand total
WITH Departement, collect({crime: Crime, total: TotalFaits})[0] AS TopCrime
RETURN Departement, TopCrime.crime AS Crime_Le_Plus_Frequent, TopCrime.total AS Nombre_De_Faits
ORDER BY Nombre_De_Faits DESC
LIMIT 10;
```
le résultat de la requête est le suivan  :
```
╒═══════════╤══════════════════════════════════════════════════════════════════════╤═══════════════╕
│Departement│Crime_Le_Plus_Frequent                                                │Nombre_De_Faits│
╞═══════════╪══════════════════════════════════════════════════════════════════════╪═══════════════╡
│"75"       │"Autres vols simples contre des particuliers dans des locaux ou lieux │1123556        │
│           │publics"                                                              │               │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"69"       │"Autres vols simples contre des particuliers dans des locaux ou lieux │312950         │
│           │publics"                                                              │               │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"59"       │"Vols à la roulotte"                                                  │310148         │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"13"       │"Vols à la roulotte"                                                  │298246         │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"92"       │"Autres vols simples contre des particuliers dans des locaux ou lieux │293044         │
│           │publics"                                                              │               │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"93"       │"Vols à la roulotte"                                                  │229428         │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"31"       │"Vols à la roulotte"                                                  │205514         │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"94"       │"Autres vols simples contre des particuliers dans des locaux ou lieux │196530         │
│           │publics"                                                              │               │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"33"       │"Autres vols simples contre des particuliers dans des locaux ou lieux │194856         │
│           │publics"                                                              │               │
├───────────┼──────────────────────────────────────────────────────────────────────┼───────────────┤
│"44"       │"Vols à la roulotte"                                                  │187028         │
└───────────┴──────────────────────────────────────────────────────────────────────┴───────────────┘
```

# 2. Analyser les connexions entre brigades et départements

Cette requête permet de cartographier la présence policière (PN) et gendarmerie (GN) sur le territoire, en comptant combien de brigades/commissariats sont connectés à chaque nœud départemental.
Copiez-collez ceci dans Neo4j :
```
MATCH (s:Service)-[:SITUE_DANS]->(d:Departement)
RETURN d.code AS Departement, 
       s.force AS Force_De_Lordre, 
       COUNT(s) AS Nombre_De_Services
ORDER BY Departement, Force_De_Lordre;
```
résultat (extrait) de la requête 2 : 
```
╒═══════════╤═══════════════╤══════════════════╕
│Departement│Force_De_Lordre│Nombre_De_Services│
╞═══════════╪═══════════════╪══════════════════╡
│"01"       │"GN"           │1                 │
├───────────┼───────────────┼──────────────────┤
│"01"       │"PN"           │8                 │
├───────────┼───────────────┼──────────────────┤
│"02"       │"GN"           │1                 │
├───────────┼───────────────┼──────────────────┤
│"02"       │"PN"           │8                 │
├───────────┼───────────────┼──────────────────┤
│"03"       │"GN"           │1                 │
├───────────┼───────────────┼──────────────────┤
│"03"       │"PN"           │4                 │
├───────────┼───────────────┼──────────────────┤
│"04"       │"GN"           │2                 │
├───────────┼───────────────┼──────────────────┤
│"04"       │"PN"           │5                 │
├───────────┼───────────────┼──────────────────┤
│"05"       │"GN"           │1                 │
├───────────┼───────────────┼──────────────────┤
│"05"       │"PN"           │7                 │
├───────────┼───────────────┼──────────────────┤
│"06"       │"GN"           │3                 │
├───────────┼───────────────┼──────────────────┤
│"06"       │"PN"           │18                │
├───────────┼───────────────┼──────────────────┤
│"07"       │"GN"           │2                 │
├───────────┼───────────────┼──────────────────┤
│"07"       │"PN"           │6                 │
├───────────┼───────────────┼──────────────────┤

```
# Requête temporelle : Évolution d'un crime spécifique
Puisque nous avons stocké l'année en tant que propriété sur la relation [:A_ENREGISTRE], nous pouvons analyser l'évolution temporelle d'un délit très facilement (par exemple : les cambriolages de logements, qui correspondent au code_index: 14).

Copiez-collez ceci dans Neo4j :
```
MATCH (s:Service)-[e:A_ENREGISTRE]->(i:Infraction {code_index: 14})
RETURN e.annee AS Annee, SUM(e.nombre_faits) AS Total_Cambriolages
ORDER BY Annee;
```
résultat de la requête : 
```
╒═════╤══════════════════╕
│Annee│Total_Cambriolages│
╞═════╪══════════════════╡
│2012 │16612             │
├─────┼──────────────────┤
│2013 │17230             │
├─────┼──────────────────┤
│2014 │20888             │
├─────┼──────────────────┤
│2015 │24030             │
├─────┼──────────────────┤
│2016 │23804             │
├─────┼──────────────────┤
│2017 │26038             │
├─────┼──────────────────┤
│2018 │28668             │
├─────┼──────────────────┤
│2019 │30632             │
├─────┼──────────────────┤
│2020 │32620             │
├─────┼──────────────────┤
│2021 │36508             │
└─────┴──────────────────┘
```

# Comparaison des performances

* Approche Relationnelle (SQL) : Basée sur des Index et des Jointures. Pour calculer le volume total d'un crime sur 10 ans, le moteur SQL doit scanner des millions de lignes dans la table des faits, vérifier les clés étrangères, puis filtrer. Le temps de réponse augmente de façon exponentielle avec le volume de données.

* Approche Graphe (Cypher/Neo4j) : Basée sur l'Index-Free Adjacency (Adjacence sans index). Le moteur trouve le nœud "Cambriolage", et "marche" littéralement le long des relations qui y sont physiquement attachées. Il n'y a pas de jointure globale à calculer. Le temps de requête reste constant et ultra-rapide (quelques millisecondes), même avec des millions de faits enregistrés.